## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.acm[0].aws_acm_certificate.main[0m has changed
[0m  [33m~[0m[0m resource "aws_acm_certificate" "main" {
        id                        = "arn:aws:acm:us-east-1:901876312125:certificate/67c975ad-592c-4a90-bb4b-21699e08ad15"
      [33m~[0m[0m status                    = "PENDING_VALIDATION" [33m->[0m[0m "ISSUED"
        tags                      = {
            "AppName"     = "sohaib-portfolio"
            "Environment" = "dev"
            "Name"        = "sohaib-portfolio-dev-cert"
        }
        [90m# (16 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.ecs.aws_ecs_service.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "main" {
      [33m~[0m[0m desired_count                      = 1 [33m->[0m[0m 2
        id                                 = "arn:aws:ecs:us-east-1:901876312125:service/ecs-webapp-cluster/sohaib-portfolio"
        name                               = "sohaib-portfolio"
        tags                               = {
            "Name" = "sohaib-portfolio-service"
        }
      [33m~[0m[0m task_definition                    = "arn:aws:ecs:us-east-1:901876312125:task-definition/sohaib-portfolio:7" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.ecs.aws_ecs_task_definition.main[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "main" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:us-east-1:901876312125:task-definition/sohaib-portfolio:7" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:us-east-1:901876312125:task-definition/sohaib-portfolio" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [33m~[0m[0m image            = "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio@sha256:96ea72660bf158e6d42d9e406b6d6e6a2c2719ad8bf4170e3e9655b5672f08f7" [33m->[0m[0m "901876312125.dkr.ecr.us-east-1.amazonaws.com/sohaibsohail/sohaib-portfolio@sha256:32ffad915c30a9626a856bba24cebaa7ebab8f1ffb8440d8773525d862227767"
                  [31m-[0m[0m mountPoints      = []
                    name             = "sohaib-portfolio"
                  [33m~[0m[0m portMappings     = [
                      [33m~[0m[0m {
                          [31m-[0m[0m hostPort      = 5000
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                  [31m-[0m[0m systemControls   = []
                  [31m-[0m[0m volumesFrom      = []
                    [90m# (4 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m enable_fault_injection   = false -> (known after apply)
      [33m~[0m[0m id                       = "sohaib-portfolio" -> (known after apply)
      [33m~[0m[0m revision                 = 7 -> (known after apply)
        tags                     = {
            "Name" = "sohaib-portfolio-task-definition"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # module.security.aws_security_group.alb[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_security_group" "alb" {
        id                     = "sg-0fd2c29542892995c"
      [33m~[0m[0m ingress                = [
          [31m-[0m[0m {
              [31m-[0m[0m cidr_blocks      = [
                  [31m-[0m[0m "0.0.0.0/0",
                ]
              [31m-[0m[0m from_port        = 80
              [31m-[0m[0m ipv6_cidr_blocks = []
              [31m-[0m[0m prefix_list_ids  = []
              [31m-[0m[0m protocol         = "tcp"
              [31m-[0m[0m security_groups  = []
              [31m-[0m[0m self             = false
              [31m-[0m[0m to_port          = 80
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m from_port        = 443
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 443
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m from_port        = 80
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 80
            },
        ]
        name                   = "ecs-webapp-alb-20250727115141314300000003"
        tags                   = {
            "Name" = "ecs-webapp-alb-sg"
        }
        [90m# (8 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 2 to change, 1 to destroy.
[0m
```
</details>